{
  "article_id": "2023-09-competitive-culture-in-mmorpg-guilds",
  "thread": [
    {
      "index": 1,
      "text": "Building competitiveness in your guild 🧵",
      "image": null
    },
    {
      "index": 2,
      "text": "Building competitiveness in your guild? Want to know how to rally the troops? Let’s go through how people are motivated in a guild. Here’s an excerpt of my own story and some practical tips and observations.",
      "image": null
    },
    {
      "index": 3,
      "text": "Chapter six of my guild memoir covers this topic specifically, read the full story at https://docs.google.com/document/d/19INsv8xt7gnrY7kD5d8db88KtuJ26uNnGxrv0acHTV4/edit https://docs.google.com/document/d/19INsv8xt7gnrY7kD5d8db88KtuJ26uNnGxrv0acHTV4/edit.",
      "image": null
    },
    {
      "index": 4,
      "text": "It’s worth noting that I personally had very limited experience in guild war, even within Ragnarok. There are many different iterations of the game and the meta changes between them depending on the version as well as the population and castle setup.",
      "image": null
    },
    {
      "index": 5,
      "text": "On Project Zero, we were facing a new iteration of the game as well as limited population and just two castles open per war. The establishment therefore evolved based on a two-guild meta and development of strategic abilities through learning rather than a known meta.",
      "image": null
    },
    {
      "index": 6,
      "text": "My personal experience did not translate very well to the game that we were now playing, so adaptation and learning became core to our approach. We started with a team of just over 10 players in our first entries to war.",
      "image": null
    },
    {
      "index": 7,
      "text": "We prepared as best we could using the limited knowledge base we had, but what was important was our focus on feedback loops.",
      "image": null
    },
    {
      "index": 8,
      "text": "The discord channel setup included at the minimum:\n• Announcements: for clear communication of goal per week\n• Strategy: summary of micro-strategy with castle maps, positioning and role specifics\n• Party setup: planned party compositions down to the individual player\n• RSVP: val-",
      "image": null
    },
    {
      "index": 9,
      "text": "idation of attendance per week\n• Role/Attendance: Selection of class/role and attendance checks\n• Feedback: post-war collection of notes and feedback for iterative improvement-\n\nWoE-feedback in the early days",
      "image": null
    },
    {
      "index": 10,
      "text": "Documentation of all these aspects made the planning and organisation of a large team possible. Use of pinned messages, appropriate formatting for important posts and other chat features helped to de-clutter messaging.",
      "image": null
    },
    {
      "index": 11,
      "text": "Though I was discouraged sometimes with the fact that not all members engage in documentation and processes, it was important to continue pushing this, almost as an ongoing need or else risk letting slip to indifference.",
      "image": null
    },
    {
      "index": 12,
      "text": "Any strong recurring concepts or particularly visual aspects would need a little bit more longevity and ease of reference. Google Docs was the preferred hosting place for that.",
      "image": null
    },
    {
      "index": 13,
      "text": "There was a need to accept defeat many times early on and chalk it up to gaining experience. The mindset normally applied to the fighting game scene was important here—learn to play through experience and by losing, adapting to your opponent and never making excuses.",
      "image": null
    },
    {
      "index": 14,
      "text": "It was also discovered that this iteration of the game particularly favoured defense. This meant that tactical strategy as well as guild development were required aspects of a successful guild, if it meant breaking into the status quo.",
      "image": null
    },
    {
      "index": 15,
      "text": "As the strategies developed over time, I found myself out of my depth in pushing the boundaries of the meta.",
      "image": null
    },
    {
      "index": 16,
      "text": "I recognised some key factors to developing a successful team:\n• Knowledge of the game must be top notch, in order to come up with new strategy\n• Commitment to testing mechanics outside of war to validate strategies\n• Continuous drive to “figure out” the answer to certain defens-",
      "image": null
    },
    {
      "index": 17,
      "text": "e/offense plays\n• A bigger picture approach involving development of players and the team-",
      "image": null
    },
    {
      "index": 18,
      "text": "There would certainly be a parallel drawn to building and running a sporting team. The only other critical factor was motivation. Different kinds of players are also motivated by different things.",
      "image": null
    },
    {
      "index": 19,
      "text": "Building and maintaining motivation for different players through ups and downs became a core focus—and there were a lot of those. Guild systems would be developed to provide for ongoing motivation and development of culture.",
      "image": null
    },
    {
      "index": 20,
      "text": "The first system designed was based around donations—to reward members for donating materials that would go toward supply for war. This was built originally to provide members as close to market value for their donations as possible in the form of donation points.",
      "image": null
    },
    {
      "index": 21,
      "text": "These points would have a value equivalent to the currency, but only usable in redeeming treasure from the spoils of war (later).",
      "image": null
    },
    {
      "index": 22,
      "text": "The second system designed was based on rewarding attendance.",
      "image": null
    },
    {
      "index": 23,
      "text": "In the theme of fairness for contribution, we sought to use something loosely based on Dragon Kill Points https://en.wikipedia.org/wiki/Dragon_kill_points which would give members points for attendance based on their gear level.",
      "image": null
    },
    {
      "index": 24,
      "text": "It made sense to use such a system as it gave members a very clear set of goals to become more involved. New members would join under probation and there was a single gear check—pass this gear check and you pass probation.",
      "image": null
    },
    {
      "index": 25,
      "text": "Probation was denoted on Discord and members were congratulated when they passed. The earnings from attendance would double as a result of passing probation.",
      "image": null
    },
    {
      "index": 26,
      "text": "We designed probation to be fairly easy to pass—requiring a devotion of approximately 15 hours to the game, which would doubly serve as a good way to introduce relatively new players to the war scene. Even for true beginners, they would have something concrete to work toward.",
      "image": null
    },
    {
      "index": 27,
      "text": "Discord used as a quick reference for anyone",
      "image": null
    },
    {
      "index": 28,
      "text": "To assist players in understanding their role in war, individual class summaries were published in a google doc. We found that despite the instructions being fairly simple and concise, nothing would be better for a player than individual experience and learning from feedback.",
      "image": null
    },
    {
      "index": 29,
      "text": "This meant that more important than giving newbies a clear path to improve, they must also be given clear, small steps to contribute and gain experience themselves.\n\n4Glory WoE doc snippet",
      "image": null
    },
    {
      "index": 30,
      "text": "On the flip side, innovation and discussion is needed to develop strategy.",
      "image": null
    },
    {
      "index": 31,
      "text": "On top of the feedback channel, additional channels were created over time — we added a “war room” channel for the more experienced members to put together strategic plays so that discussion could be distilled to the wider audience — there were some key contributors here includi-",
      "image": null
    },
    {
      "index": 32,
      "text": "ng Taki, Acru and Chaika from Pandan’s squad.- There would sometimes be endless back-and-forth discussion developing strategy down to:\n• individual cell positions/placements\n• testing of skills and timings to validate strategy\n• overlaid maps and notes for communication",
      "image": null
    },
    {
      "index": 33,
      "text": "Their contributions earnt Pandan squad the title of “The Lab” / “R+D Dept”. There’s no doubt the rest of the team would have had trouble continuing to push the boundaries without them and we always considered it a critical need to “keep moving forward or risk falling behind”.",
      "image": null
    },
    {
      "index": 34,
      "text": "One system I almost neglected to mention was our chosen system for distributing the hotly contested costumes/cosmetics—via a combined lottery and bidding system. The reason for this choice was to provide a balance between rewarding loyal and new members.",
      "image": null
    },
    {
      "index": 35,
      "text": "The other options based on bidding alone (employed by other guilds) tended to favour loyal members mainly due to the scarcity of costumes.",
      "image": null
    },
    {
      "index": 36,
      "text": "This system worked by allowing members to bid their attendance points toward a costume of choice and random.org would be used to determine the winner. Any winners would have their points deducted and put on a cooldown whilst other bidders would have their bid points returned.",
      "image": null
    },
    {
      "index": 37,
      "text": "Later in 4G’s development, strategic play would further mature into a core team that would provide coverage of all critical roles, be willing to swap/share characters and gear and work towards the next level of competitiveness.",
      "image": null
    },
    {
      "index": 38,
      "text": "As with this new channel, I loved to see the fire of competitiveness with each new challenge.\n\nA common (and welcome) sight. Lots of brainstorming after facing new challenges",
      "image": null
    },
    {
      "index": 39,
      "text": "About one month into the competitive war scene — we took our first castle. The take was opportunistic as SQ the primary guild was using the chance to swap castle ownerships. And so, simply by showing up, we earnt the right to a first success.",
      "image": null
    },
    {
      "index": 40,
      "text": "I think the parallel here to real life is knowing that by simply showing up and putting in the work, you avail yourself of good opportunities. And when people complain that the rewards came “free” — does that invalidate all the work we had put in? Not a chance.",
      "image": null
    },
    {
      "index": 41,
      "text": "There was also an adrenaline-pumping moment in the war event that night that many of us present that night will not forget…",
      "image": null
    },
    {
      "index": 42,
      "text": "A very well populated guild had recently been spun out of Indonesian players, by numbers alone they had more than we did — they called themselves Warmindos. Positioning themselves as the 4th guild on the scene, we naturally made it our prerogative to at least best them in combat.",
      "image": null
    },
    {
      "index": 43,
      "text": "The last 10 minutes of war that night had their entire army positioned at the Emperium (last line) of our castle and we held the defense so close to failure that the majority of the team experienced the longest final minute ever, ending the war with a castle in our shaking, swea-",
      "image": null
    },
    {
      "index": 44,
      "text": "ty hands and the greatest feeling of elation and accomplishment.- The journey had just begun.",
      "image": null
    },
    {
      "index": 45,
      "text": "Read the full article:\nhttps://ripxg.com/blog/2023-09-competitive-culture-in-mmorpg-guilds",
      "image": null
    }
  ],
  "total_tweets": 45,
  "canonical_url": "https://ripxg.com/blog/2023-09-competitive-culture-in-mmorpg-guilds"
}