{
  "article_id": "2023-09-starting-an-mmorpg-guild-choosing-people",
  "thread": [
    {
      "index": 1,
      "text": "Thinking of starting an MMO guild 🧵",
      "image": null
    },
    {
      "index": 2,
      "text": "Thinking of starting an MMO guild? Do you know who will join you? Lots of transferable skills! Let’s go through how people are the key ingredients of a guild. Here’s an excerpt of my own story and some specific observations.",
      "image": null
    },
    {
      "index": 3,
      "text": "Chapter five of my guild memoir covers this topic specifically, read the full story at https://docs.google.com/document/d/19INsv8xt7gnrY7kD5d8db88KtuJ26uNnGxrv0acHTV4/edit https://docs.google.com/document/d/19INsv8xt7gnrY7kD5d8db88KtuJ26uNnGxrv0acHTV4/edit.",
      "image": null
    },
    {
      "index": 4,
      "text": "The co-founders of the guild were myself, Eddd, Sushi, Prayo and Stevie. Leaving the comfort of their existing guilds and starting a new one meant that these people had the fire of uprising/revolution driving them.",
      "image": null
    },
    {
      "index": 5,
      "text": "I’d soon validate that success would be purely defined by the mindset of the driven. Further to the parallels already drawn to IRL… people are the common thread across social constructs regardless of the medium; video game, commercial company or cult.",
      "image": null
    },
    {
      "index": 6,
      "text": "The team had a range of strengths that rose to the surface quickly:",
      "image": null
    },
    {
      "index": 7,
      "text": "Eddd had a strong understanding of the community and competitive energy.\n\nSushi had the tireless, supportive capability to do the things the others wouldn’t.\n\nPrayo had a knack for structure and an accountant’s depth of experience in detail.",
      "image": null
    },
    {
      "index": 8,
      "text": "Stevie had the fearless, competitive spirit and eternal hunger for more.",
      "image": null
    },
    {
      "index": 9,
      "text": "The splitting of tasks was relatively easy given our individual strengths but most important was the common thread of an invested mindset.",
      "image": null
    },
    {
      "index": 10,
      "text": "In the early weeks, we even held weekly planning meetings on top of 1-on-1 calls I set up with each of the co-founders to hear+provide any feedback and unspoken ideas.",
      "image": null
    },
    {
      "index": 11,
      "text": "Sometimes we’d get a snap reminder that we were still just playing an online game… we lost Prayo to IRL shortly after 4G’s inception. I joked at the time that he’d retire to our board of directors.",
      "image": null
    },
    {
      "index": 12,
      "text": "Stevie had a trusted team member who had already picked up many of the same tasks Prayo had been covering, mostly to do with spreadsheets and numbers. Looking back, we wouldn’t have gotten very far without him.",
      "image": null
    },
    {
      "index": 13,
      "text": "Dric, who would later be dubbed our CFO, was a spreadsheet genius but also a creative and tirelessly determined.",
      "image": null
    },
    {
      "index": 14,
      "text": "To illustrate the point, he took our blank slate and added:\n• A Guild logo that we could all get behind\n• A spreadsheet for tracking member details and gear progression he called “revolution is nigh”\n• A spreadsheet for tracking guild donations and supplies he called “seizing th-",
      "image": null
    },
    {
      "index": 15,
      "text": "e means of production”-\n\nDric’s own design, full resolution guild logo\n\nGuild Roster: revolution is nigh\n\nGuild finances: seizing the means of production",
      "image": null
    },
    {
      "index": 16,
      "text": "These spreadsheets started out simple but were developed over time to cover many scenarios and automated workflows. We would take chances to debate optimisations and changes on discord and in the early days, there were lots of ideas flowing.",
      "image": null
    },
    {
      "index": 17,
      "text": "The details of these structures I’ll cover in a later chapter. The pace of change was rapid, so the ability for us to vote and move on quickly was important. Whenever we needed to make a divisive decision, it would come to a vote with myself as the tie-breaker.",
      "image": null
    },
    {
      "index": 18,
      "text": "The squad leader structure started to prove very effective once Eddd and Stevie had introduced prominent community members, Pandan and LuBu to the guild. These guys were natural community leaders with their respective nationality-based groups.",
      "image": null
    },
    {
      "index": 19,
      "text": "The way the squads worked out as the size of the guild scaled was that the squads in turn created a space for their own leaders.",
      "image": null
    },
    {
      "index": 20,
      "text": "It wasn’t long before we faced a growth problem due to the nature of the server itself. The server had many veterans, with the server being approximately a year old by this point, but few new-starters.",
      "image": null
    },
    {
      "index": 21,
      "text": "Most new-starters don’t make it through the game for very long either and so our talent pool for recruitment was severely limited.",
      "image": null
    },
    {
      "index": 22,
      "text": "Before we could tackle the recruitment issue, we still needed to develop our war strategy and individual progression. We had just started to participate in competitive war scenarios at this point and were beginning to build up a level of confidence in our abilities.",
      "image": null
    },
    {
      "index": 23,
      "text": "So began our preparation for war.",
      "image": null
    },
    {
      "index": 24,
      "text": "Read the full article:\nhttps://ripxg.com/blog/2023-09-starting-an-mmorpg-guild-choosing-people",
      "image": null
    }
  ],
  "total_tweets": 24,
  "canonical_url": "https://ripxg.com/blog/2023-09-starting-an-mmorpg-guild-choosing-people"
}