{
  "article_id": "2023-09-the-4-biggest-business-development-mistakes-in-crypto",
  "thread": [
    {
      "index": 1,
      "text": "Hey there, crypto leaders and growth enthusiasts! Pull up a chair and lend me your ears (well, eyes technically, since this isn't a podcast). Coming from the coal face of growth and business development — our humble team at XGlobal https://... 🧵",
      "image": null
    },
    {
      "index": 2,
      "text": "Learn from others' mistakes—so much time can be saved spinning wheels in our industry—that's the key to joining the fast lane to growth!\n\nSo, let’s pop the bonnet on these mistakes, rev up our learning engines, and get you turbocharged for a smoother journey to success!",
      "image": null
    },
    {
      "index": 3,
      "text": "Inefficient Lead Generation and Conversion Process",
      "image": null
    },
    {
      "index": 4,
      "text": "Spending time \"grinding\" can lead your BD team and the company as a whole into a false sense of progress. This is by far the greatest risk to your survival as even a stellar product team builds something that falls behind competitors in capability and brand presence.",
      "image": null
    },
    {
      "index": 5,
      "text": "No doubt, grit and hard work goes a long way, but it does not make up for moving in the wrong direction and working on the wrong things.",
      "image": null
    },
    {
      "index": 6,
      "text": "Any effort required on behalf of a prospect should be treated as poisonous to your conversion process.",
      "image": null
    },
    {
      "index": 7,
      "text": "I've seen integration processes that require involvement of prospect engineering/product teams and this can 2-3x the lead time to value and qualify out 5x as much as an integration process that can be handled by the prospect BD/marketing team.",
      "image": null
    },
    {
      "index": 8,
      "text": "This is OK only if the integration feature can be improved and manual process is used only to prove a working concept on a valuable prospect.",
      "image": null
    },
    {
      "index": 9,
      "text": "If the conversion process is kept to a high probability and with expected lead-time, then outreach messaging can scale up to provide ongoing pipeline.",
      "image": null
    },
    {
      "index": 10,
      "text": "When your product is updated to support more use-cases (or existing use-cases in a better way), you can refresh your entire pipeline with new onboarding campaigns.",
      "image": null
    },
    {
      "index": 11,
      "text": "A blueprint for success could be summarised as follows:\n• Win-win proposal for any target partner/prospect\n• Ease of conviction for any BD reps who are tasked with positioning prospects\n• 50+% probability of verbal commitment within a 30 minute prospect call\n• Minimal engagement-",
      "image": null
    },
    {
      "index": 12,
      "text": "of partner resources (<2 hours, single department)\n• Strong lead generation and pipeline activity (1000+ monthly customised outreach messages in early stage are possible in-house or supplementary https://xglobal.gg)\n• Build network effects over time using your product to expand -",
      "image": null
    },
    {
      "index": 13,
      "text": "your reach and breathe life into \"expended\" pipeline-\n\nLack of Consistency in Sales and Marketing Efforts\n\nIf your BD and Marketing teams are not in lockstep, you are in for a world of pain—\"the left hand does not know what the right hand is doing\".",
      "image": null
    },
    {
      "index": 14,
      "text": "Partnerships should include engagement of the BD and Marketing teams of the prospect.",
      "image": null
    },
    {
      "index": 15,
      "text": "To make the coordinated efforts of both your team and prospects, it's advisable to use a shared (templated https://xglobal.gg) Google Doc that summarises the campaign or partnership benefits as well as a optimised list of commitments from both you and the partner.",
      "image": null
    },
    {
      "index": 16,
      "text": "This should likely contain co-marketing asks and timelines.",
      "image": null
    },
    {
      "index": 17,
      "text": "Communication to partners becomes important and can add some overhead to BD operations, but not too difficult to handle with some offshore BD resourcing https://xglobal.gg.",
      "image": null
    },
    {
      "index": 18,
      "text": "With any new proof points or offerings that extend beyond the product or internal tooling, you should expect that manual efforts and communication become more difficult—ensure that you look ahead and plan for expected load and aren't caught surprised when a few balls are dropped.",
      "image": null
    },
    {
      "index": 19,
      "text": "Failing to Define a Clear Business Development Strategy",
      "image": null
    },
    {
      "index": 20,
      "text": "Revenue at all costs is not a strategy. Partnering with as many other projects as possible is not a strategy.",
      "image": null
    },
    {
      "index": 21,
      "text": "Your partnership program should target bigger players in the space and have a clear win-win proposal—one that might take some time to craft but once drafted, can be positioned with strong conviction and commitment to drive it for at least a few weeks.",
      "image": null
    },
    {
      "index": 22,
      "text": "If you are used to flexibility and adaptability, trust that it can be built into the process, with growth reviews done between BD, Marketing, Product on weekly or biweekly basis. Set up a team structure and regular cadence https://xglobal.gg that really improves iteratively.",
      "image": null
    },
    {
      "index": 23,
      "text": "A BD team in crypto has an even steeper mountain to climb, not only are they finding product market fit, but it's possible that they will be creating an entirely new market with crypto/web3 capabilities that have not been done at scale before.",
      "image": null
    },
    {
      "index": 24,
      "text": "But isn't that what we crypto entrepreneurs love? The thrill, the challenge, the chance to change the world?",
      "image": null
    },
    {
      "index": 25,
      "text": "Now, imagine this. You're not just tasked with finding a product-market fit, which is a big, scary task in itself.",
      "image": null
    },
    {
      "index": 26,
      "text": "Nope, you might just have the burden (read opportunity) of creating an entirely novel market with crypto or web3 capabilities, something that hasn't been tested at scale before. Now, that's what you call a double whammy, right?",
      "image": null
    },
    {
      "index": 27,
      "text": "Remember, finding a product-market fit is a significant business development step, but if you're in the realm of crypto, the stakes get even higher. You're not just fitting in; you're breaking new ground and potentially creating markets.",
      "image": null
    },
    {
      "index": 28,
      "text": "You need to aim beyond the 'fit'. Your goal must be to create a value proposition in a novel or vastly improved way. Sounds complicated? It's not. DeFi opened up worlds of opportunity. NFTs opened up worlds of opportunity.",
      "image": null
    },
    {
      "index": 29,
      "text": "Similarly, marketplaces and launchpads are opening up opportunities for projects to offer niche audiences a smooth experience.\n\nIn the words of Peter Drucker: \"The aim of marketing is to know and understand the customer so well the product or service fits him and sells itself.\"",
      "image": null
    },
    {
      "index": 30,
      "text": "But remember, creating this kind of value isn't just for keeping your customers happy and securing their loyalty. It also doubles as a stellar sales hook for all your prospect calls.",
      "image": null
    },
    {
      "index": 31,
      "text": "And What's a Sales Hook, You Ask?",
      "image": null
    },
    {
      "index": 32,
      "text": "It's a powerful, enticing message that grabs your potential customers' attention and gets them hooked on what you're offering.",
      "image": null
    },
    {
      "index": 33,
      "text": "If you take time to position your product to market needs and add a novel improvement (many options in crypto/web3), your sales hook will practically write itself. • Step 1: Determine what makes your crypto product or service unique, and how it creates a new or improved value.",
      "image": null
    },
    {
      "index": 34,
      "text": "• Step 2: Polish this idea until you have a 90 second \"elevator pitch\" (ask us for some help on this https://xglobal.gg) that gets positive responses\n• Step 3: Back up the elevator pitch with personalisation and a deck/doc that can be shared with the rest of their team",
      "image": null
    },
    {
      "index": 35,
      "text": "Finally, BD strategy must also ensure that any engagements done with partners and customers are easy to deliver on.",
      "image": null
    },
    {
      "index": 36,
      "text": "The worst thing that you could do is overpromise and underdeliver, which can turn a miracle commitment from a big partner into getting yourselves blacklisted and ignored. At an early stage, repeat customer engagement is really important as you test new offerings.",
      "image": null
    },
    {
      "index": 37,
      "text": "Inability to Recruit and Retain Top Talent",
      "image": null
    },
    {
      "index": 38,
      "text": "Onboarding can cost you months. Finding the right person for the role and for the company can be a really tough gamble with time.",
      "image": null
    },
    {
      "index": 39,
      "text": "Sales and BD can be one of the more unforgiving experiences for talent retention; good talent goes where the best opportunities are and this can be tough for your org to maintain. Your recruitment strategy and budget needs to account for your desirability as a brand/workplace.",
      "image": null
    },
    {
      "index": 40,
      "text": "Finding the right person, not just for the role, but also for your company, can be a gamble. It's not just about picking up the most sparkling CV that comes your way in a timely fashion, it's also about finding that special someone who'd fit into your unique little work family!",
      "image": null
    },
    {
      "index": 41,
      "text": "Remember, every time you roll the dice with new hires, you roll with months of time, effort, and resources on stake. It's not just about filling a position, it's about extending your dream team!",
      "image": null
    },
    {
      "index": 42,
      "text": "Once you've got the ball rolling, you might find that onboarding can eat into months of your precious startup time. It's not only about introducing the newbie to their role, but also about them understanding your business model, adapting to your company culture.",
      "image": null
    },
    {
      "index": 43,
      "text": "Overlook this, and you might find yourself stuck in a maddening loop of hire-train-leave-repeat.",
      "image": null
    },
    {
      "index": 44,
      "text": "Here are some quick pointers to save the day (and your sanity):\n• Give yourself enough room to accommodate unplanned changes and last-minute hiccups. Remember, this isn't a sprint, it's a marathon.",
      "image": null
    },
    {
      "index": 45,
      "text": "• Look for partners https://xglobal.gg who can help beef up your hiring and training game if you're struggling to handle it on your own.",
      "image": null
    },
    {
      "index": 46,
      "text": "• Developing a foolproof onboarding strategy https://xglobal.gg and process, peppered with elements of your company culture, helps instil confidence in the newly hired, and they're less likely to jump ship.",
      "image": null
    },
    {
      "index": 47,
      "text": "If you found any of the tips above insightful, work on taking action. If you'd like to dive into any of these with someone who has been in the trenches, drop us a message https://xglobal.gg.",
      "image": null
    },
    {
      "index": 48,
      "text": "Good luck on your growth journey.",
      "image": null
    },
    {
      "index": 49,
      "text": "Read the full article:\nhttps://ripxg.com/blog/2023-09-the-4-biggest-business-development-mistakes-in-crypto",
      "image": null
    }
  ],
  "total_tweets": 49,
  "canonical_url": "https://ripxg.com/blog/2023-09-the-4-biggest-business-development-mistakes-in-crypto"
}