{
  "article_id": "2023-09-how-to-start-a-guild-in-an-mmorpg",
  "thread": [
    {
      "index": 1,
      "text": "Thinking of starting an MMO guild 🧵",
      "image": null
    },
    {
      "index": 2,
      "text": "Thinking of starting an MMO guild? Do you also have experience as a corporate drone? Lots of transferable skills! Let’s go through how you can take an idea and start your guild with a bang with my own story and some specific tips.",
      "image": null
    },
    {
      "index": 3,
      "text": "Chapter four of my guild memoir covers this topic specifically, read the full story at https://docs.google.com/document/d/19INsv8xt7gnrY7kD5d8db88KtuJ26uNnGxrv0acHTV4/edit https://docs.google.com/document/d/19INsv8xt7gnrY7kD5d8db88KtuJ26uNnGxrv0acHTV4/edit.",
      "image": null
    },
    {
      "index": 4,
      "text": "In 2020, mobiles were already at the centre of the professional workspace and running a guild turned out to be no different. From your mobile phone, hooked into communication + productivity apps (and the internet), there is not much you can’t do.",
      "image": null
    },
    {
      "index": 5,
      "text": "Now that 4Glory was officially a guild, there were a lot of decisions to make. Having started from scratch, there was no structure, no coverage for disaster and no growth plan; risking the chance to get off the ground, particularly within a game that others would play casually.",
      "image": null
    },
    {
      "index": 6,
      "text": "I remembered a document written by an over-eager friend of mine, a “Guild Rules” document that he’d written over a decade ago. It had the skeleton of what I wanted to be the groundwork of the guild — some guidelines around structure and purpose.",
      "image": null
    },
    {
      "index": 7,
      "text": "I made this the first Google Doc and etched in our first cultural definitions.\n\nGoogle Docs hosted document for easy editing and sharing",
      "image": null
    },
    {
      "index": 8,
      "text": "I hoped that this would give our new co-founders confidence in my ability and seriousness, such that they would similarly take the challenge seriously.",
      "image": null
    },
    {
      "index": 9,
      "text": "The mission statement written in the document was purposeful:\n• Become and maintain a consistent, major presence in WoE on Ragnarok: Project Zero. • Uphold the fair contribution and distribution system as well as culture that set us apart from the start.",
      "image": null
    },
    {
      "index": 10,
      "text": "• Truly understand that we are greater than the sum of our parts. • Have fun and be competitive.",
      "image": null
    },
    {
      "index": 11,
      "text": "These would allow us to make quick decisions early on ie. if an idea supports the mission statement, invest in it.",
      "image": null
    },
    {
      "index": 12,
      "text": "The rules would also serve a greater purpose:\n• Settle your differences\n• All members should find themselves represented by a group leader\n• You must have your character(s) logged on the roles list\n• Do not spread rumours or defame other players or guilds.",
      "image": null
    },
    {
      "index": 13,
      "text": "This means not engaging in or escalating negative exchanges with others.",
      "image": null
    },
    {
      "index": 14,
      "text": "The general theme of the rules was also to provide structure to the social aspect of the guild; an attempt to minimise the risk of internal conflict as well as risk of tarnishing the guild brand — particularly poignant was rule 4, which is all too easy to break in a competitive,-",
      "image": null
    },
    {
      "index": 15,
      "text": "online environment.- Rule 2 was important to me because I wanted each member to feel looked after and the only way I would be able to guarantee that was by implementing a tiered “reporting” structure.",
      "image": null
    },
    {
      "index": 16,
      "text": "After all, even in the workplace it’s understood that having more than 7 or 8 direct reports lends the leader to being spread too thin.",
      "image": null
    },
    {
      "index": 17,
      "text": "The parallels to organisational psychology and the workplace became overt. There’s a famous quote “culture eats strategy for breakfast”, something I believed but wanted to trial with my own hands, hence the initial focus of groundwork on culture.",
      "image": null
    },
    {
      "index": 18,
      "text": "Yes — this very much was an outlet for me to trial directorship and test management theories at the risk of being too serious for an online game!",
      "image": null
    },
    {
      "index": 19,
      "text": "Once the core team was established, it became obvious how important culture was to building a team.",
      "image": null
    },
    {
      "index": 20,
      "text": "Culture:\n• allows for details to go unsaid\n• allows for alignment to a common goal, and\n• gives individuals a sense of belonging or purpose through their own interpretation of their place within the cultural bounds",
      "image": null
    },
    {
      "index": 21,
      "text": "4G was quite differentiated from other guilds through this culture alone:\n• Near zero tolerance of trash talking of the competition regardless of public or internally, reducing ego from the competitive mindset\n• Work hard mentality, driven by small goals and continuous improveme-",
      "image": null
    },
    {
      "index": 22,
      "text": "nt, allowing individuals to work well on their own\n• Sense of responsibility that filters down from leadership to squads-\n\nWhat then mattered most, were the people building out the vision.",
      "image": null
    },
    {
      "index": 23,
      "text": "Read the full article:\nhttps://ripxg.com/blog/2023-09-how-to-start-a-guild-in-an-mmorpg",
      "image": null
    }
  ],
  "total_tweets": 23,
  "canonical_url": "https://ripxg.com/blog/2023-09-how-to-start-a-guild-in-an-mmorpg"
}